
alert( "Қош келдіңіз, саяхатшы! Сіз саяхатқа шыққалы жатырсыз. Сіздің таңдауыңыз - сіздің тағдырыңызды анықтайды.");


var Name = prompt("Өз есіміңізді енгізіңіз:");
alert(Name + ", сапарыңыз басталды!");


var adventure = prompt("Сіз қиылыста тұрсыз. солға немесе оңға барасызба?");

if (adventure == "солға") {
  alert("Сіз солға бұрылдыңыз. Жол соңында орман бар.");
} else if (adventure == "оңға") {
  alert("Сіз оңға бұрылдыңыз. Алдыңызда өзен тұр.");
}

var river = prompt(
  "Сіз өзенге жеттіңіз. жүзіп өтесізбе, әлде қайық  жасайсызба?"
);

if( river  == "жүзіп") {
  alert("өзенді жүзіп өту арқылы көп уақытыңызды жоғалтып алдыңыз.");
} else if (river == "қайық") {
  alert("қайық жасау арқылы шаршамай өзенді тез өттіңіз.");
}

var treasure = prompt("Сіз қазына таптыңыз. ашасызба, әлде тиіспейсізбе?");

if (treasure == "ашу") {
  alert(" Жоқ, сіз тұзаққа түсіп қалдыңыз!" );
} else if (treasure == "тиіспеу") {
  alert("Жарайсыз сіз қазынаны ашпау арқылы тұзаққа түскен жоқсыз");
} 

alert("Құттықтаймыз сіздің сапарыңыз сәтті аяқталды.");
